<template>
  <div id='tmpl'>
   <div class="title">
      <h4 v-text="list.title"></h4>
      <p>{{list.add_time | datefmt("YYYY-MM-DD HH:mm:ss")}} {{list.click}}次点击</p>
   </div>
   <div class="content" v-html="list.content"></div>

    <comment :id="id"></comment>
  </div>
</template>
<script>

import { Toast } from 'mint-ui';

import common from "../../kits/common.js";

import comment from "../subcom/comment.vue";

export default {
  
  data () {
    return {
        
        id:0,
       /*list:{
            id: 14,
            title: "买房还是炒股，2015年买房无法拒绝的5大理由",
            click: 2,
            add_time: "2015-04-16T04:05:34.000Z",
            content: "<p> 时间稍纵即逝，转眼间2015年已经过去了4个月，在这短短的四个月，股市攀升到了4000点， 这让很多原本对股市不抱期望的人再度春心萌动。同样，在这个四个月的时间里，楼市经历了死而复活聚变，一浪高过一浪的救市政策把楼市推到风口浪尖至少，房价涨声再起。 </p> <p> <br /> 于是关于买房还是炒股的话题再次老生常谈。炒股好还是买房好，当一路高歌猛进的股市遇到大手笔的楼市新政，人们如何在炒股与买房之间做出选择，似乎更加困难。 </p> <p> <br /> 为此，湘潭365房产网购房专家表示，炒股更多是投机，而非投资，也就是趁着股市大涨行情， 捞一把；而买房，更多是一种需求或者长期投资。因此，如果你没有足够的资金，那么弃股买房是最佳选择，但是如果你不缺钱，但同时又有买房需求，那么先炒股，后买房，但宗旨是见好就收。 </p> <p> <br /> 需要声明的是，即便是楼市整体复苏，好的房子仍然需要购房者精挑细选，即使在亢奋的牛市行情中，满仓踏空者也不在少数，因此，无论是买房还是炒股，都应该把握规律，不能因为盲目跟风，失去了理性的判断力。 </p> <p> <br /> 说了这么多，湘潭365房产网购房专家还是认为，买房比炒股更有利，尤其是在当前政策如此宽松，房贷如此优惠的前期下，更是绝佳的买房时机，以下编辑整理出的2015年买房无法拒绝的5大理由，供您参考。 </p> <p> <br /> <strong>1，楼市政策宽松 </strong> </p> <p> <br /> 首套房“认贷不认房”，二套房首付降低4成，央行两次降息，9折房贷利率、二手房交易营业税5调2，首套房住房公积金贷款首付最低2成、二套房3成....等等楼市政策是自2008年之后最宽松时期。 </p> <p> <br /> 对于购房者来说，不仅降低了买房门槛，更节约的买房成本，此时买房无疑是一举两得。 </p> <p> <br /> <strong>2，房子是固定资产</strong> </p> <p> <br /> 买房相对于炒股，更具抗风险。尽管短期内炒股可能小赚一笔，但是股市风云难测，跌的时候是不见谷底；但是，买房则不同，不管房价如何变动，房子始终是你的，你想住就住，想出租就出租，你拥有足够的话语权，不至于像买股票那样提心吊胆 </p> <p> <br /> <strong>3，买房会强迫储蓄 </strong> </p> <p> <br /> 买房最大的好处就是让不懂理财或者月光族变成理财高手。如果你能以每个月2000的价格租一套公寓，而不是月供2400元买一套，租房或许有点意义。但你会省下这400元以备未来之需吗？很多人都不会。我敢说大多数人都不会。在这里你又必须自己盘算了，不过你的贷款月供中偿还本金的部分不能算是成本。其实你的钱是给自己的，因为你积累了资产。作为一种强制性的每月储蓄，这是种很好的自律。 </p> <p> <br /> <strong>4，选择余地很大 </strong> </p> <p> <br /> 近五年房地产市场的快速发展，导致楼市严重供过于求，尤其是经历了2014年楼市的“调整”之后，当前全国大多数地方都有充足的房源。 </p> <p> <br /> &nbsp;以湘潭为例，尽管年销售只有200万平米左右，但是当前库存已经超过450万平米，这相当于2年半的销售量。而且随着此次二手房交易政策放宽，还有更多的存量房不断进入市场。这种情况意味着选择多多，而且价格实惠。 </p> <p> <br /> <strong>5，房价反弹只是时间问题 </strong> </p> <p> <br /> 房价还会下跌吗？当然会，你永远都抄不到底，但这长期来看并不重要。以目前的楼市政策以及市场环境，房价反弹只是时间问题，更何况每天都有如此之多的市民加入买房一族，楼市回暖迫在眉睫。 </p> <p> <br /> 结语：对于购房者来场，抄底是个梦，但是不买房永远抄不到底。在众多利好的政策和价格优势下，2015年买房应该是不错的选择。 </p>"
    }*/
        list:{}
        
    };
  },
  created(){
    
    this.id = this.$route.params.id;
    this.gitInfo();
  },

  //注册评论子组件
components:{
            comment
        },

  methods:{
      gitInfo(){
        var url = common.apidomain + "/api/getnew/"+this.id;
        this.$http.get(url).then(function(res){
            if(res.body.status != 0) {
                Toast(res.body.message);
            }
            this.list = res.body.message[0]; // 这里的[0]是取res.body.message的第一项,因为this.list定义的是一个对象
        })
      }
  },
  
}
</script>
<style lang="css" scoped>

.title h4 {
    color: #0094ff;
}
.title p {
    color: rgba(0,0,0,0.4);
}
.title,.content {
    padding: 10px;
}
</style>